[
  {
    "title": "Artichoke Hearts and Palm Hearts",
    "prep_time": "10 Min. + 30 Min. Marinieren",
    "ingredients": [
      "ca. 16 Artichoke hearts, preserved in can or jar",
      "1 large can of palm hearts (palm sprouts), about 1 kg",
      "For Sauce Vinaigrette:",
      "4 tbsp white vinegar",
      "8 tbsp oil",
      "½ tsp sharp mustard",
      "½ tsp each salt and pepper",
      "½ grated onion",
      "2 hard-boiled eggs",
      "1-2 bunches of parsley"
    ],
    "instructions": [
      "For the sauce, finely chop the hard-boiled eggs and parsley. Mix mustard, salt, pepper, grated onion, and vinegar, then gradually add the oil and beat the marinade with a whisk. Mix the eggs and parsley into the sauce.",
      "Drain the artichoke hearts and palm hearts. Optionally, halve the artichokes. Cut the palm hearts into bite-sized pieces. Arrange the vegetables separately in bowls, drizzle with vinaigrette sauce, and let rest for 30 minutes before serving."
    ],
    "notes": "Palm hearts also taste good with a sauce made from yogurt, mayonnaise, tomato ketchup, and spices.",
    "suggested_wine": "Sauvignon Blanc or an unoaked Chardonnay",
    "calories_approx": "250-300 per serving"
  },
  {
    "title": "Fish in a Crispy Crust",
    "prep_time": "15 Min. + 40 Min. Baking",
    "ingredients": [
      "8 fish fillets (600 g)",
      "Juice of 1 lemon",
      "Salt, pepper",
      "4 slices of Cheddar cheese",
      "1 packet of frozen puff pastry",
      "1 egg",
      "1 tomato",
      "1 piece of cucumber"
    ],
    "instructions": [
      "Wash and dry the fish fillets, marinate in lemon juice for 10 minutes, and season with salt and pepper.",
      "Thaw the puff pastry and cut into 4 squares. Place a slice of Cheddar cheese between two pieces of fish, then wrap in the pastry squares, pressing the edges firmly. Brush the fish packets with beaten egg and bake in a preheated oven at 175°C for 40 minutes.",
      "Garnish the fish with cucumber slices and diced tomato, and serve immediately."
    ],
    "notes": "Serve the fish hot with remoulade sauce and white bread sticks.",
    "suggested_drink": "White wine.",
    "calories_approx": "400-450 per serving"
  }
]